vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32c092/ADC_reginfo.h
/* This file is generated by stm32_reggen.py from stm32c092xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the ADC register metadata for the stm32c092 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
static const stm32_reginfo_t stm32_c092_adc_reginfo[RI_END] =
{
	[RI_ISR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00002B9F }, /* mask = 0b00000000000000000010101110011111 */
	[RI_IER            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00002B9F }, /* mask = 0b00000000000000000010101110011111 */
	[RI_CR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x90000017 }, /* mask = 0b10010000000000000000000000010111 */
	[RI_CFGR1          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x7CE1FDFF }, /* mask = 0b01111100111000011111110111111111 */
	[RI_CFGR2          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xE00003FD }, /* mask = 0b11100000000000000000001111111101 */
	[RI_SMPR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x07FFFF77 }, /* mask = 0b00000111111111111111111101110111 */
	[RI_AWD1TR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0FFF0FFF }, /* mask = 0b00001111111111110000111111111111 */
	[RI_AWD2TR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0FFF0FFF }, /* mask = 0b00001111111111110000111111111111 */
	[RI_CHSELR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_AWD3TR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0FFF0FFF }, /* mask = 0b00001111111111110000111111111111 */
	[RI_DR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_AWD2CR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0007FFFF }, /* mask = 0b00000000000001111111111111111111 */
	[RI_AWD3CR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0007FFFF }, /* mask = 0b00000000000001111111111111111111 */
	[RI_CALFACT        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000007F }, /* mask = 0b00000000000000000000000001111111 */
};

